<?php
// +----------------------------------------------------------------------
// | 零云 [ 简单 高效 卓越 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016 http://www.lingyun.net All rights reserved.
// +----------------------------------------------------------------------
// | Author: jry <598821125@qq.com>
// +----------------------------------------------------------------------
// | 版权申明：零云不是一个自由软件，是零云官方推出的商业源码，严禁在未经许可的情况下
// | 拷贝、复制、传播、使用零云的任意代码，如有违反，请立即删除，否则您将面临承担相应
// | 法律责任的风险。如果需要取得官方授权，请联系官方http://www.lingyun.net
// +----------------------------------------------------------------------
return array(
    'status'  => array(
        'title'   => '是否显示:',
        'type'    => 'radio',
        'options' => array(
            '1' => '显示',
            '0' => '不显示',
        ),
        'value'   => '1',
    ),
    'title'   => array(
        'title' => '显示标题:',
        'type'  => 'text',
        'value' => '天气预报',
    ),
    'city'    => array(
        'title' => '显示城市',
        'type'  => 'text',
        'tip'   => '前台显示可不填',
        'value' => '南京',
    ),
    'showday' => array(
        'title'   => '显示天数',
        'type'    => 'select',
        'options' => array(
            '1' => '1天',
            '2' => '2天',
            '3' => '3天',
            '4' => '4天',
        ),
        'value'   => '4',
    ),
    'ak'      => array(
        'title' => '百度密钥',
        'type'  => 'text',
        'value' => '51da9f03c9731fa65316f2c93c13cb26',
    ),
);
